Repository: pypi-data/pypi-mirror-291
Catalog: packages/dj-accounts/dj-accounts-4.0.2.tar.gz/dj-accounts-4.0.2/dj_accounts/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Required, please provide your username
ar: مطلوب، يرجى ادخال اسم المستخدم الخاص بك

source: Required, please provide your email
ar: مطلوب، يرجى ادخال البريد الالكترونى الخاص بك

source: Required, please provide your phone number
ar: مطلوب، يرجى ادخال رقم الهاتف الخاص بك

source: Password
ar: كلمة المرور

source: Remember Me
ar: تذكرني

source: Please enter a correct credentials. Note that fields may be case-sensitive.
ar: يرجي ادخال بيانات صحيحية

source: This account is inactive.
ar: هذا الحساب محظور

source: Please enter a correct credentials
ar: يرجى ادخال بيانات صحيحية

source: The Provided code is Properly invalid
ar: الرقم المدخل غير صحيح

source: Please Enter the first name
ar: يرجى ادخال الاسم الاول

source: New Email
ar: البريد الالكترونى الجديد

source: Please enter a correct phone and password. Note that both fields may be case-sensitive.
ar: يرجى ادخال رقم هاتف و كلمة مرور صحيحين

source: Email already exists
ar: البريد الالكترونى مسجل مسبقا

source: Please Enter the new Email
ar: يرجى ادخل البريد الالكتروني الجديد

source: Please Enter Valid Password
ar: يرجى ادخل كلمة مرور صحيحة

source: Your Password
ar: كلمة المرور الخاصة بك

source: Invalid token.
ar: رمز غير صحيح

source: Enter the same password as before, for verification.
ar: تأكيد كلمة المرور غير مطابق لكلمة المرور

source: Accounts
ar: الحسابات

source: You're receiving this email because you registered new account at %(site_name)s.
ar: وصلك هذا البريد الالكتروني لتسجيلك حساب جديد فى %(site_name)s.

source: Please click on the link to confirm your registration:
ar: يرجى النقر على الرابط التالى لتأكيد حسابك:

source: Your username, in case you’ve forgotten:
ar: فى حالة نسيانك، اسم المستخدم الخاص بك هو:

source: Thanks for using our site!
ar: شكرا لاستخدامك موقعنا!

source: The %(site_name)s team
ar: فريق %(site_name)s

source: Your Account is verified successfully
ar: تم تأكيد حسابك بنجاح

source: Something went wrong, please try to contact customer service
ar: حدث خطأ، يرجى التواصل مع خدمة العملاء

source: Login
ar: تسجيل الدخول

source: Log in to start your session
ar: سجل الدخول لبدء التصفح

source: I forgot my password
ar: نسيت كلمة المرور

source: Register a new membership
ar: تسجيل حساب جديد

source: I agree to the
ar: اقبل

source: trems
ar: الشروط

source: Login With Phone
ar: الدخول باستخدام الهاتف

source: Alert!
ar: تنبية

source: OR
ar: او

source: Sign in using Facebook
ar: تسجيل الدخول بواسطة فيسبوك

source: Sign in using Google+
ar: تسجيل الدخول بواسطة Google+

source: Password Reset
ar: اعادة ضبط كلمة المرور

source: Your password has been set. You may go ahead and log in now.
ar: تم ضبط كلمة المرور الخاص بك، يمكنك الآن تسجيل الدخول

source: Log in
ar: تسجيل الدخول

source: Password reset confirmation
ar: تأكيد اعادة ضبط كلمة المرور

source: Please enter your new password twice so we can verify you typed it in correctly.
ar: يرجى ادخال كلمة المرور وتأكيدها بشكل صحيح

source: Change my password
ar: تغيير كلمة المرور

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
ar: لقد وصلتك هذه الرسالة لانك طلبت تغيير كلمة المرور للحساب الخاص بك على %(site_name)s.

source: Please go to the following page and choose a new password:
ar: يرجى الدخول على الرابط التالي لاعادة ضبط كلمة المرور

source: Reset my password
ar: تغيير كلمة المرور الخاصة بي

source: Password reset on %(site_name)s
ar: تغيير كلمة المرور ل %(site_name)s.

source: Update Email
ar: تحديث البريد الالكترونى

source: Submit
ar: ارسال

source: Update Phone number
ar: تحديث رقم الهاتف

source: Update User Data
ar: تحديث بيانات الملف الشخصى

source: The given email must be set
ar: يجب ادخال البريد الالكترونى

source: email address
ar: البريد الالكتروني

source: username
ar: اسم المستخدم

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
ar: مطلوب. 150 حرفًا أو أقل. أحرف وأرقام و @ /. / + / - / _ فقط.

source: A user with that phone already exists.
ar: يوجد مستخدم بنفس رقم الهاتف

source: message sent to phone number: {}
ar: تم ارسال رسالة الى رقم: {}

source: Code was resent successfully.
ar: تم اعادة ارسال رمز التحقق

source: Email was verified successfully.
ar: تم تفعيل عنوان البريد الالكتروني بنجاح

source: A new confirmation code has been sent to your phone
ar: تم ارسال رمز تحقق جديد الى هاتفك

source: Update User Info
ar: تحديث بيانات الحساب

source: your profile has been updated successfully
ar: تم تحديث بيانات حسابك بنجاح

source: Update Phone Number
ar: تحديث رقم الهاتف

source: Activate your account.
ar: تفعيل الحساب الخاص بك

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

source: We’ve emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
ar: لقد أرسلنا إليك عبر البريد الإلكتروني إرشادات حول تعيين كلمة المرور الخاصة بك ، إذا كان لديك حسابموجود مع البريد الإلكتروني الذي أدخلته. يجب أن تتسلمه قريبًا.

source: If you don’t receive an email, please make sure you’ve entered the address you registered with, and check your spam folder.
ar: إذا لم تتلق بريدًا إلكترونيًا ، فيرجى التأكد من إدخال العنوانقمت بالتسجيل مع ، وتحقق من مجلد الرسائل غير المرغوب فيها.

source: Email activation link resent successfully
ar: تم إعادة إرسال رابط تنشيط البريد الإلكتروني بنجاح

source: Email Changed Successfully
ar: تم تغيير البريد الإلكتروني بنجاح
