from autonomous.infra.llm.llms import llm
from langchain.evaluation import load_evaluator, EvaluatorType

# test evaluation prompt

# chain = evaluation_all_tasks_prompt | llm | JsonOutputParser()
# messages = [{
#     "task": "分析用户输入问题的目标和要求, 以及该问题所涉及的领域和背景信息.",
#     "task_response": "\n用户给定问题的目标:\n```\n主要目标：编写一个完整的武侠小说，字数不少于3000字，内容要求详细丰富。\n```\n\n用户给定问题的要求:\n```\n用户需要一篇完整的武侠小说，字数要求在3000字以上。小说应包含详细的情节、人物描绘和场景刻画，不需要提纲或指导意见，要求直接提供完整的小说文本。\n```\n\n用户给定问题涉及的领域:\n```\n这个用户问题涉及的领域是：文学 - 武侠小说创作。\n```\n"
# },
#     # {'task': '撰写武侠小说的开头部分，包括背景设定、主要人物介绍和初始冲突的设定。', 'task_response': '在遥远的古代，一个名叫「天龙」的神秘门派坐落在云雾缭绕的天山之巅。这个门派以守护世间和平，维护江湖正义为己任，门下弟子皆是武艺超群，侠肝义胆。然而，天龙派的平静被一个名叫「血月」的邪派组织打破，血月以贪婪和野心为动力，意图夺取天龙派的至宝——龙脉石，这块神秘的石头据说蕴含着无尽的武学力量。\n\n故事的主角，李云飞，是天龙派的年轻弟子，他天赋异禀，剑法独步江湖。他的父亲是天龙派的前任掌门，因抵抗血月的侵袭而英勇牺牲。李云飞在父亲的遗物中发现了一封信，信中揭示了龙脉石的秘密，以及血月的阴谋。信中还提到，只有找到龙脉石，才能阻止血月的野心，恢复江湖的安宁。\n\n李云飞决定继承父亲的遗志，保护天龙派，寻找龙脉石。他带着父亲的佩剑，踏上了充满危险的旅程。在旅途中，他结识了聪明伶俐的红袖，她是江湖上闻名的盗贼，因一次意外卷入了这场纷争。红袖虽然盗贼出身，但心地善良，她被李云飞的正义感所打动，决定帮助他对抗血月。\n\n初始冲突在李云飞和血月的爪牙之间展开，血月为了得到龙脉石，不断派出杀手追杀李云飞。在一次激烈的对决中，李云飞和红袖联手，成功击退了血月的刺客，但也因此暴露了他们的行踪。血月的首领，阴险狡诈的血月魔君，决定亲自出手，一场江湖大战即将在天龙派和血月之间爆发。\n\n然而，龙脉石的下落仍然成谜，李云飞和红袖必须在血月的追杀下，解开父亲留下的线索，找到龙脉石，才能阻止血月的阴谋。他们的冒险旅程充满了未知，但他们的决心和勇气，将引领他们走向未知的江湖，书写属于他们的武侠传奇。'}
# ]
# resp = chain.invoke({
#     "human_input_task": "帮我写一个武侠小说, 你要给我一个完整的3000字以上的小说, 不要只给提纲和指导意见!小说越详细越好",
#     "requirements": "用户需要一篇完整的武侠小说，字数要求在3000字以上。小说应包含详细的情节、人物描绘和场景刻画，不需要提纲或指导意见，要求直接提供完整的小说文本。",
#     "solution_steps": format_solution_steps(messages)
# })
# print(resp)

custom_criteria = {
    "完成性": "是否严格完成了任务",
    "丰富性": "表述是否具有的故事情节",
}
evaluator = load_evaluator(EvaluatorType.CRITERIA, llm=llm, criteria=custom_criteria)
eval_result = evaluator.evaluate_strings(
    prediction="在遥远的古代，一个名叫「天龙」的神秘门派坐落在云雾缭绕的天山之巅。这个门派以守护世间和平，维护江湖正义为己任，门下弟子皆是武艺超群，侠肝义胆。然而，天龙派的平静被一个名叫「血月」的邪派组织打破，血月以贪婪和野心为动力，意图夺取天龙派的至宝——龙脉石，这块神秘的石头据说蕴含着无尽的武学力量。\n\n故事的主角，李云飞，是天龙派的年轻弟子，他天赋异禀，剑法独步江湖。他的父亲是天龙派的前任掌门，因抵抗血月的侵袭而英勇牺牲。李云飞在父亲的遗物中发现了一封信，信中揭示了龙脉石的秘密，以及血月的阴谋。信中还提到，只有找到龙脉石，才能阻止血月的野心，恢复江湖的安宁。\n\n李云飞决定继承父亲的遗志，保护天龙派，寻找龙脉石。他带着父亲的佩剑，踏上了充满危险的旅程。在旅途中，他结识了聪明伶俐的红袖，她是江湖上闻名的盗贼，因一次意外卷入了这场纷争。红袖虽然盗贼出身，但心地善良，她被李云飞的正义感所打动，决定帮助他对抗血月。\n\n初始冲突在李云飞和血月的爪牙之间展开，血月为了得到龙脉石，不断派出杀手追杀李云飞。在一次激烈的对决中，李云飞和红袖联手，成功击退了血月的刺客，但也因此暴露了他们的行踪。血月的首领，阴险狡诈的血月魔君，决定亲自出手，一场江湖大战即将在天龙派和血月之间爆发。\n\n然而，龙脉石的下落仍然成谜，李云飞和红袖必须在血月的追杀下，解开父亲留下的线索，找到龙脉石，才能阻止血月的阴谋。他们的冒险旅程充满了未知，但他们的决心和勇气，将引领他们走向未知的江湖，书写属于他们的武侠传奇",
    input="帮我写一个武侠小说, 你要给我一个完整的300字以上的完整小说, 不要只给提纲和指导意见!小说越详细越好.",
)
print(eval_result)